In [1]:
import pandas as pd
import matplotlib as plt

#### Open the dataset

In [2]:
titanic = pd.read_csv("dataset/titanic.csv", sep = ",")

#### Data exploration

In [3]:
titanic.head(20)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
10,1,3,Miss. Marguerite Rut Sandstrom,female,4.0,1,1,16.7000
11,1,1,Miss. Elizabeth Bonnell,female,58.0,0,0,26.5500
12,0,3,Mr. William Henry Saundercock,male,20.0,0,0,8.0500
13,0,3,Mr. Anders Johan Andersson,male,39.0,1,5,31.2750
14,0,3,Miss. Hulda Amanda Adolfina Vestrom,female,14.0,0,0,7.8542
15,1,2,Mrs. (Mary D Kingcome) Hewlett,female,55.0,0,0,16.0000
16,0,3,Master. Eugene Rice,male,2.0,4,1,29.1250
17,1,2,Mr. Charles Eugene Williams,male,23.0,0,0,13.0000
18,0,3,Mrs. Julius (Emelia Maria Vandemoortele) Vande...,female,31.0,1,0,18.0000
19,1,3,Mrs. Fatima Masselmani,female,22.0,0,0,7.2250

#### Drop columns

In [4]:
print(titanic.shape)
drop_columns = ['Fare', 'Name']
titanic.drop(drop_columns, axis = "columns", inplace = True)
print(titanic.shape)

(887, 8)
(887, 6)

### Rename columns

In [5]:
print(titanic.head(1))
titanic.columns = ['Survived', 'Pclass','Sex','Age','SSA','PCOB']
print(titanic.head(1))

   Survived  Pclass   Sex   Age  Siblings/Spouses Aboard  \
0         0       3  male  22.0                        1

   Parents/Children Aboard
0                        0
   Survived  Pclass   Sex   Age  SSA  PCOB
0         0       3  male  22.0    1     0

### Visualize the types of data

In [6]:
titanic.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SSA           int64
PCOB          int64
dtype: object

### Change Data type. Handle categorical data

In [7]:
titanic.Sex = titanic.Sex.apply(lambda x : 1 if x== "male" else 0)
titanic.dtypes

Survived      int64
Pclass        int64
Sex           int64
Age         float64
SSA           int64
PCOB          int64
dtype: object

In [8]:
titanic.head()

   Survived  Pclass  Sex   Age  SSA  PCOB
0         0       3    1  22.0    1     0
1         1       1    0  38.0    1     0
2         1       3    0  26.0    0     0
3         1       1    0  35.0    1     0
4         0       3    1  35.0    0     0

### Order columns

In [9]:
titanic = titanic [['Survived','Pclass', 'Sex',  'Age', 'SSA', 'PCOB']]
titanic.head()

   Survived  Pclass  Sex   Age  SSA  PCOB
0         0       3    1  22.0    1     0
1         1       1    0  38.0    1     0
2         1       3    0  26.0    0     0
3         1       1    0  35.0    1     0
4         0       3    1  35.0    0     0